///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, Щербаков Вадим, chtcherbakov.vadim@gmail.com
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
// Ссылка на репозитарий:
// https://github.com/shcherbakov-vadim/object_model.git

Функция ПолучитьТаблицыОбъекта(ИмяТаблицы) Экспорт
	МассивРезультат = Новый Массив;
	МассивИмяОбъекта = СтрРазделить(ИмяТаблицы, ".");
	Для Каждого МетаданныеТЧ Из Метаданные.НайтиПоПолномуИмени(МассивИмяОбъекта[0] + "." + МассивИмяОбъекта[1]).ТабличныеЧасти Цикл
		МассивРезультат.Добавить(МетаданныеТЧ.Имя);
	КонецЦикла;
	
	Возврат МассивРезультат;	
КонецФункции
