
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НоваяСтрока = Корзина.Добавить();
	НоваяСтрока.Номенклатура = ВыбраннаяСтрока;
	НоваяСтрока.Количество = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ДанныеСтроки = Новый Структура("Номенклатура,Количество");
	
	КонтекстИзменений = глМодель_НачатьИзменения(ВладелецФормы);
	Для Каждого СтрокаТаблицы Из Корзина Цикл
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы);
		
		НоваяСтрока = глМодель_Данные(ВладелецФормы).Товары.Добавить();
		глМодель_ИзменитьРеквизитыСтроки(КонтекстИзменений, НоваяСтрока, ДанныеСтроки);
	КонецЦикла;
	глМодель_ЗавершитьИзменения(КонтекстИзменений);
	
	Закрыть();
КонецПроцедуры
