
&НаКлиенте
Процедура СоздатьПриходы(Команда)
	СоздатьОбъектыСервер();
	ОповеститьОбИзменении(Тип("ДокументСсылка.Приход"));
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектыСервер()
	ДокументОбъект = глМодель_НачатьИзменения(Документы.Приход.СоздатьДокумент());
	
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("Дата", ТекущаяДата());
	глМодель_ИзменитьРеквизиты(ДокументОбъект, РеквизитыШапки);
	
	РеквизитыСтроки = Новый Структура("Номенклатура,Количество");
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		ЗаполнитьЗначенияСвойств(РеквизитыСтроки, СтрокаТаблицы);
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		глМодель_ИзменитьРеквизитыСтроки(ДокументОбъект, НоваяСтрока, РеквизитыСтроки);
	КонецЦикла;
	
	глМодель_ЗавершитьИзмененияИЗаписать(ДокументОбъект);
КонецПроцедуры