#Область Интерфейс_МодульМодели
Процедура Модель_ПриУстановкеСвойств(КонтекстИзменений, ИменаСвойств) Экспорт
	Если глМодель_ТребуетсяУстановитьСвойства(КонтекстИзменений, "КоэффициентПересчетаСумма", ИменаСвойств) Тогда
		глМодель_УстановитьСвойство(КонтекстИзменений, "КоэффициентПересчетаСуммаРегл", 65);
	КонецЕсли;
КонецПроцедуры

Процедура Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, ДанныеСтроки, ИменаСвойств) Экспорт
	Если ДанныеСтроки = Неопределено Тогда
		Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, "Товары", ИменаСвойств);
		Возврат;
		
	ИначеЕсли ДанныеСтроки = "Товары" Тогда
		Для Каждого СтрокаТаблицы Из глМодель_Данные(КонтекстИзменений)[ДанныеСтроки] Цикл
			Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, СтрокаТаблицы, ИменаСвойств)
		КонецЦикла;
		Возврат
	КонецЕсли;
	
	Если глМодель_ТребуетсяУстановитьСвойстваСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры", ИменаСвойств) Тогда
		глМодель_УстановитьЗначениеСвойства(КонтекстИзменений, ДанныеСтроки.Номенклатура.Тип);
	КонецЕсли;
	
	Если глМодель_ТребуетсяУстановитьСвойстваСтроки(КонтекстИзменений, ДанныеСтроки, "ДлинаТипаНоменклатуры", ИменаСвойств) Тогда
		глМодель_УстановитьЗначениеСвойства(КонтекстИзменений, СтрДлина(глМодель_ПолучитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры")));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область МодульМодель_Действия
Процедура ОбновитьИтоги(КонтекстИзменений, Параметры) Экспорт
	глМодель_ИзменитьРеквизит(КонтекстИзменений, "Сумма", глМодель_Данные(КонтекстИзменений).Товары.Итог("Сумма"));	
КонецПроцедуры
#КонецОбласти