#Область Интерфейс_МодульМодели
Процедура Модель_ПриУстановкеСвойств(КонтекстИзменений, ИменаСвойств) Экспорт
	глМодель_УстановитьСвойство(КонтекстИзменений, "КоэффициентПересчетаСуммаРегл", 65);
КонецПроцедуры

Процедура Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, ДанныеСтроки, Свойства) Экспорт
	Если ДанныеСтроки = Неопределено Тогда
		Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, "Товары", Свойства);
		Возврат;
		
	ИначеЕсли ДанныеСтроки = "Товары" Тогда
		Для Каждого СтрокаТаблицы Из глМодель_Данные(КонтекстИзменений)[ДанныеСтроки] Цикл
			Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, СтрокаТаблицы, Свойства)
		КонецЦикла;
		Возврат
	КонецЕсли;
	
	глМодель_УстановитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры", ДанныеСтроки.Номенклатура.Тип);
КонецПроцедуры
#КонецОбласти

Процедура ОбновитьИтоги(КонтекстИзменений, Параметры) Экспорт
	глМодель_ИзменитьРеквизит(КонтекстИзменений, "Сумма", глМодель_Данные(КонтекстИзменений).Товары.Итог("Сумма"));	
КонецПроцедуры
