#Область Интерфейс_МодульМодели
Процедура Модель_ПриУстановкеСвойств(КонтекстИзменений, ИменаСвойств) Экспорт
	глМодель_УстановитьСвойство(КонтекстИзменений, "КоэффициентПересчетаСуммаРегл", 65);
КонецПроцедуры

Процедура Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, ДанныеСтроки, ИменаСвойств) Экспорт
	Если ДанныеСтроки = Неопределено Тогда
		Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, "Товары", ИменаСвойств);
		Возврат;
		
	ИначеЕсли ДанныеСтроки = "Товары" Тогда
		Для Каждого СтрокаТаблицы Из глМодель_Данные(КонтекстИзменений)[ДанныеСтроки] Цикл
			Модель_ПриУстановкеСвойствСтроки(КонтекстИзменений, СтрокаТаблицы, ИменаСвойств)
		КонецЦикла;
		Возврат
	КонецЕсли;
	
	Если глМодель_ПроверитьВхождение(ИменаСвойств, "ТипНоменклатуры") Тогда
		глМодель_УстановитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры", ДанныеСтроки.Номенклатура.Тип);
	КонецЕсли;
	
	Если глМодель_ПроверитьВхождение(ИменаСвойств, "ДлинаТипаНоменклатуры") Тогда
		глМодель_УстановитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ДлинаТипаНоменклатуры"
			,СтрДлина(глМодель_ПолучитьСвойствоСтроки(КонтекстИзменений, ДанныеСтроки, "ТипНоменклатуры")));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Процедура ОбновитьИтоги(КонтекстИзменений, Параметры) Экспорт
	глМодель_ИзменитьРеквизит(КонтекстИзменений, "Сумма", глМодель_Данные(КонтекстИзменений).Товары.Итог("Сумма"));	
КонецПроцедуры
