#Область Подсистема_МодульМодели
&НаКлиенте
Функция Модель_ОбработатьДействия(КонтекстИзменений) Экспорт
	Возврат Модель_ОбработатьДействияСервер(КонтекстИзменений);
КонецФункции

&НаСервере
Функция Модель_ОбработатьДействияСервер(КонтекстИзменений)
	Возврат глМодель_ОбработатьДействия(КонтекстИзменений, ЭтаФорма);
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока
		И ОтменаРедактирования Тогда
		
		Возврат;
	КонецЕсли;
	
	глМодель_ПриИзмененииРеквизита(ЭтаФорма, "Товары");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	глМодель_ПриИзмененииРеквизита(ЭтаФорма, "Товары");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	ЗаполнитьТоварыСервер()	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыСервер()
	РеквизитыСтроки = Новый Структура;
	РеквизитыСтроки.Вставить("Номенклатура", Справочники.Номенклатура.НайтиПоНаименованию("Номенклатура 1"));
	РеквизитыСтроки.Вставить("Количество", 3);
	
	КонтекстИзменений = глМодель_НачатьИзменения(ЭтаФорма);
	НоваяСтрока = Объект.Товары.Добавить();
	глМодель_ИзменитьРеквизитыСтроки(КонтекстИзменений, НоваяСтрока, РеквизитыСтроки);
	глМодель_ЗавершитьИзменения(КонтекстИзменений);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
	ОткрытьФорму("Обработка.ПодборТоваров.Форма", , ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	глМодель_ОбновитьСвойства(ЭтаФорма);
	глМодель_ОбновитьСвойстваСтроки(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	глМодель_ОбновитьСвойстваСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаЗакупкиПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "ЦенаЗакупки");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаЗакупкиПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "СуммаЗакупки");
КонецПроцедуры
